/*
    时间：2020年2月18日21:14
    目的：
        测试C语言中’&&'和'||'的用法
    总结：
        1. A && B，如果A假，则B不会再执行
        2. A || B，如果A真，则B也不会再执行
*/

# include <stdio.h>

int main(void)
{
    int k = 20;
    int i = 10;
    int j = 30;
    int m;

    // 注意对比这里的 k==5 和 k=5 的区别，前者是逻辑判断，后者是重新赋值
    m = (3>2) && (k==5);
    printf("m = %d, k = %d\n", m, k);  // 输出结果：m = 0, k = 20，这里k没有被重新赋值
    m = (3>2) && (k=5);
    printf("m = %d, k = %d\n", m, k);  // 输出结果：m = 1, k = 5，这里k被重新赋值

    // 注意这里的短路原则，能不运算就不运算，能偷懒就偷懒，设计哲学
    m = (1>2) && (i=5);
    printf("m = %d, i = %d\n", m, i);  // 输出结果：m = 0, i = 10，这里因为 1>2 不成立，所以i=5没有执行，故 i初始值10
    m = (3>2) && (i=5);
    printf("m = %d, i = %d\n", m, i);  // 输出结果：m = 1, i = 5，这里因为 3>2 成立，所以i=5执行，i重新赋值为5

    m = (3>2) || (j=5);
    printf("m = %d, j = %d\n", m, j);  // 输出结果：m = 1, j = 30，这里因为 3>2 成立，所以j=5不执行，故 j初始值30
    m = (1>2) || (j=5);
    printf("m = %d, j = %d\n", m, j);  // 输出结果：m = 1, j = 5，这里因为 1>2 不成立，所以j=5执行，j重新赋值为5

    return 0;
}

/*
    在VSCode中的输出结果是：
--------------------------
m = 0, k = 20
m = 1, k = 5
m = 0, i = 10
m = 1, i = 5
m = 1, j = 30
m = 1, j = 5
--------------------------
*/