/*
    时间：2020年2月18日18:12
    目的：
        测试C语言中除法运算符'/'的用法
    总结：
        1. C语言中，两个int相除，所得结果，直接舍弃小数部分，不会四舍五入，如：19/4 = 3
        2. C语言中，除数和被除数只要有一个是浮点数，结果就是浮点型，会带上小数部分。
        3. 输出控制符与变量类型必须严格一致，整型不能用%f，否则会出错。
*/

# include <stdio.h>

int main(void)
{
    int i, j, k;
    float m, n;
    i = 19;
    j = 3;
    k = 4;
    m = 19.0;
    n = 4.0;

    // C语言中两个int相除，直接舍弃小数部分，不会四舍五入
    printf("%d/%d = %d\n", i, j, i/j);
    printf("%d/%d = %d\n", i, k, i/k);

    // printf("%d/%d = %d\n", i, n, i/n);  // 输出：19/0 = 0
    // printf("%d/%f = %d\n", i, n, i/n);  // 输出：19/4.000000 = 0
    printf("%d/%f = %f\n", i, n, i/n);  // 正确输出：19/4.000000 = 4.750000
    printf("i = %f\n", i);  // 输出 i = 0.000000，被舍弃了整数部分
    printf("%f/%d = %f\n", m, j, m/j);  //  正确输出：19.000000/3 = 6.333333


    return 0;
}

/*

    在VSCode中的输出结果是：
--------------------------
19/3 = 6
19/4 = 4
19/4.000000 = 4.750000
i = 0.000000
19.000000/3 = 6.333333
--------------------------

*/