/*
    时间：2020年2月18日18:32
    目的：
        测试C语言中除法运算符'%'的用法
    总结：
        1. C语言中，%两个数必须是整数，出现浮点数报错
        2. C语言中，%所得余数的结果符号与被除数相同，与除数无关
*/


# include <stdio.h>

int main(void)
{
    int i, j, m, n;
    float k;

    i = 5;
    j = 3;
    m = -5;
    n = -3;
    k = 2.0;

     // C语言中两个int相除，直接舍弃小数部分，不会四舍五入
    printf("%d%%%d = %d\n", i, j, i%j);  // 输出结果：5%3 = 2
    printf("%d%%%d = %d\n", i, n, i%n);  // 输出结果：5%-3 = 2
    printf("%d%%%d = %d\n", m, j, m%j);  // 输出结果：-5%3 = -2
    printf("%d%%%d = %d\n", m, n, m%n);  // 输出结果：-5%-3 = -2
    // printf("%d%%%f = %f\n", i, k, i%k);  // error 
 
    return 0;
}


/*
    在VSCode中的输出结果是：
--------------------------
5%3 = 2
5%-3 = 2
-5%3 = -2
-5%-3 = -2
--------------------------
*/