/*
    时间：2020年2月20日18:57:19
    目的：
        测试 C 语言中除法 '/' 和取余 '%' 运算
*/

/*
# include <stdio.h>

int main(void)
{
    printf("a/b, a 和 b 都是 int 型时：\n");
    printf("11/4 = %d\n", 11/4);
    printf("11/(-4) = %d\n", 11/(-4));
    printf("(-11)/4 = %d\n", (-11)/4);

    printf("\n");

    printf("a/b, a 和 b 不全是 int 型时：\n");
    printf("11.0/4 = %f\n", 11.0/4);
    printf("11.0/(-4) = %f\n", 11.0/(-4));
    printf("(-11.0)/4.0 = %f\n", (-11.0)/4.0);

    printf("\n");

    printf("11%%4 = %d\n", 11%4);
    printf("11%%(-4) = %d\n", 11%(-4));
    printf("(-11)%%4 = %d\n", (-11)%4);

    return 0;
}

*/
/*
    在VSCode中的输出结果是：
--------------------------
a/b, a 和 b 都是 int 型时：
11/4 = 2
11/(-4) = -2
(-11)/4 = -2

a/b, a 和 b 不全是 int 型时：
11.0/4 = 2.750000
11.0/(-4) = -2.750000
(-11.0)/4.0 = -2.750000

11%4 = 3
11%(-4) = 3
(-11)%4 = -3
--------------------------
*/



/*
    时间：2020年2月20日20:27:36
    目的：
        测试 C 语言中取余 '%' 运算对数据类型的要求
    总结：
        C语言中 a%b，a 和 b必须是整型
*/


# include <stdio.h>

int main(void)
{
    printf("(-11.0)%%4 = %d\n", (-11.0)%4);
    return 0;
}

/*
    在VSCode中的输出结果是：
--------------------------
error: invalid operands to binary % (have 'double' and 'int')
     printf("(-11.0)%%4 = %d\n", (-11.0)%4);
                                 ~~~~~~~^
--------------------------
*/