/*
    时间：2020年2月19日 19：21
    功能：
        任意三个数从小到大排序
    总结：
        1. 程序的灵魂是算法思想。
        2. 先思考清楚怎么做，再去敲代码。
*/

# include <stdio.h>

int main(void)
{
    int a, b, c;  // 等价于：int a; int b; int c;
    int t;  // 临时变量

    printf("请输入三个整数（中间以空格分隔：");
    scanf("%d %d %d", &a, &b, &c);
    printf("排序前三个数分别是：a = %d, b = %d, c = %d\n", a, b, c);

    // 编写代码完成a是最大值  b是中间值  c是最小值
    if (a < b)
    {
        t = a;
        a = b;
        b = t;
    }

    if (a < c)
    {
        t = a;
        a = c;
        c = t;
    }

    if (b < c)
    {
        t = b;
        b = c;
        c = t;
    }

    printf("排序后三个数分别是：a = %d, b = %d, c = %d\n", a, b, c);
   
    return 0;
}

/*
    在VSCode中的输入输出结果是：
--------------------------
请输入三个整数（中间以空格分隔：1 5 9
排序前三个数分别是：a = 1, b = 5, c = 9
排序后三个数分别是：a = 9, b = 5, c = 1
--------------------------
*/